#    Напишите программу, которая принимает на вход два числа и проверяет,
#    является ли одно число квадратом другого.

#    *Примеры:*

#    - 5, 25 -> да
#    - 4, 16 -> да
#    - 25, 5 -> да
#    - 8,9 -> нет

# n = int(input("Введите 1-ое число: "))
# m = int(input("Введите 2-ое число: "))
# if n == m**2 or m == n**2:
#    print("yes")
# else:
#    print("no")


# 2. Напишите программу, которая на вход принимает 5 чисел
#     и находит максимальное из них.

#    Примеры:

#    - 1, 4, 8, 7, 5 -> 8
#    - 78, 55, 36, 90, 2 -> 90

# max = -1
# for i in range(5):
#    n = int(input())
#    if max < n:
#       max = n
# print(max)

# Метод флажка
# flag = True
# i = 0
# while flag:
#     i += 1
# if i == 11:
#     flag = False
# print(i)


