# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

n = 600
list = [2, 3, 5, 7, 11, 13]
new = []
i = 0

while n>1:
    if n % list[i] == 0:
        new.append(list[i])
        n //= list[i]
    else:
        i+=1
    
print(new)



